var a = [{
    "name": "かぜ",
    "value": "かぜ",
    "synonyms": ["かぜ", "風疹", "りんご病", "手足口病", "インフルエンザ", "おたふくかぜ", "流行性耳下腺炎", "カゼ", "フウシン", "リンゴビョウ", "テアシクチビョウ", "オタフクカゼ", "リュウコウセイジカセンエン", "ふうしん", "りんごびょう", "てあしくちびょう", "いんふるえんざ", "りゅうこうせいじかせんえん", "風しん"],
    "originSynonyms": ["かぜ", "風疹", "りんご病", "手足口病", "インフルエンザ", "おたふくかぜ", "流行性耳下腺炎"]
}, {
    "name": "はしか",
    "value": "はしか",
    "synonyms": ["はしか", "麻疹", "ハシカ", "マシン", "ましん", "麻しん"],
    "originSynonyms": ["はしか", "麻疹"]
}, {
    "name": "EBウイルス感染症",
    "value": "EBウイルス感染症",
    "synonyms": ["EBウイルス感染症", "デング熱", "伝染性単核症", "EBウイルスカンセンショウ", "デングネツ", "デンセンセイタンカクショウ", "EBういるすかんせんしょう", "でんぐねつ", "でんせんせいたんかくしょう", "イービーウイルスカンセンショウ", "いーびーういるすかんせんしょう"],
    "originSynonyms": ["EBウイルス感染症", "デング熱", "伝染性単核症"]
}, {
    "name": "急性灰白髄炎",
    "value": "急性灰白髄炎",
    "synonyms": ["急性灰白髄炎", "ポリオ", "キュウセイカイハクズイエン", "きゅうせいかいはくずいえん", "ぽりお"],
    "originSynonyms": ["急性灰白髄炎", "ポリオ"]
}, {
    "name": "髄膜炎",
    "value": "髄膜炎",
    "synonyms": ["髄膜炎", "ウイルス性髄膜炎", "無菌性髄膜炎", "細菌性髄膜炎", "日本脳炎", "ウイルス性脳炎", "ズイマクエン", "ウイルスセイズイマクエン", "ムキンセイズイマクエン", "サイキンセイズイマクエン", "ニホンノウエン", "ウイルスセイノウエン", "ずいまくえん", "ういるすせいずいまくえん", "むきんせいずいまくえん", "さいきんせいずいまくえん", "にほんのうえん", "ういるすせいのうえん"],
    "originSynonyms": ["髄膜炎", "ウイルス性髄膜炎", "無菌性髄膜炎", "細菌性髄膜炎", "日本脳炎", "ウイルス性脳炎"]
}, {
    "name": "エイズ",
    "value": "エイズ",
    "synonyms": ["エイズ", "後天性免疫不全症候群", "コウテンセイメンエキフゼンショウコウグン", "えいず", "こうてんせいめんえきふぜんしょうこうぐん"],
    "originSynonyms": ["エイズ", "後天性免疫不全症候群"]
}, {
    "name": "食中毒",
    "value": "食中毒",
    "synonyms": ["食中毒", "ショクチュウドク", "しょくちゅうどく"],
    "originSynonyms": ["食中毒"]
}, {
    "name": "ジフテリア",
    "value": "ジフテリア",
    "synonyms": ["ジフテリア", "腸チフス", "チョウチフス", "じふてりあ", "ちょうちふす"],
    "originSynonyms": ["ジフテリア", "腸チフス"]
}, {
    "name": "脊椎カリエス",
    "value": "脊椎カリエス",
    "synonyms": ["脊椎カリエス", "セキツイカリエス", "せきついかりえす"],
    "originSynonyms": ["脊椎カリエス"]
}, {
    "name": "結核性胸膜炎",
    "value": "結核性胸膜炎",
    "synonyms": ["結核性胸膜炎", "ケッカクセイキョウマクエン", "けっかくせいきょうまくえん"],
    "originSynonyms": ["結核性胸膜炎"]
}, {
    "name": "肺結核",
    "value": "肺結核",
    "synonyms": ["肺結核", "ハイケッカク", "はいけっかく"],
    "originSynonyms": ["肺結核"]
}, {
    "name": "コロナ",
    "value": "コロナ",
    "synonyms": ["コロナ", "コロナ陽性", "COVID-19", "PCR検査陽性", "抗原検査陽性", "コロナヨウセイ", "PCRケンサヨウセイ", "コウゲンケンサヨウセイ", "ころな", "ころなようせい", "PCRけんさようせい", "こうげんけんさようせい", "コビッドナインティーン", "こびっどないんてぃーん"],
    "originSynonyms": ["コロナ", "コロナ陽性", "COVID-19", "PCR検査陽性", "抗原検査陽性"]
}, {
    "name": "コロナ疑い",
    "value": "コロナ疑い",
    "synonyms": ["コロナ疑い", "COVID-19疑い", "コロナウタガイ", "COVID-19ウタガイ", "ころなうたがい", "COVID-19うたがい", "コビッドナインティーンウタガイ", "こびっどないんてぃーんうたがい"],
    "originSynonyms": ["コロナ疑い", "COVID-19疑い"]
}]
var b = [{
    "name": "肺がん",
    "value": "肺がん",
    "synonyms": ["肺がん", "食道がん", "ハイガン", "ショクドウガン", "はいがん", "しょくどうがん", "肺ガン", "食道ガン", "肺癌", "食道癌"],
    "originSynonyms": ["肺がん", "食道がん"]
}, {
    "name": "肝臓がん",
    "value": "肝臓がん",
    "synonyms": ["肝臓がん", "すい臓がん", "胆のうがん", "胆管がん", "カンゾウガン", "スイゾウガン", "タンノウガン", "タンカンガン", "かんぞうがん", "すいぞうがん", "たんのうがん", "たんかんがん", "肝臓ガン", "すい臓ガン", "胆のうガン", "胆管ガン", "肝臓癌", "すい臓癌", "胆のう癌", "胆管癌"],
    "originSynonyms": ["肝臓がん", "すい臓がん", "胆のうがん", "胆管がん"]
}, {
    "name": "乳がん",
    "value": "乳がん",
    "synonyms": ["乳がん", "ニュウガン", "にゅうがん", "乳ガン", "乳癌"],
    "originSynonyms": ["乳がん"]
}, {
    "name": "卵巣がん",
    "value": "卵巣がん",
    "synonyms": ["卵巣がん", "ランソウガン", "らんそうがん", "卵巣ガン", "卵巣癌"],
    "originSynonyms": ["卵巣がん"]
}, {
    "name": "悪性リンパ腫",
    "value": "悪性リンパ腫",
    "synonyms": ["悪性リンパ腫", "白血病", "非ホジキンリンパ腫", "アクセイリンパシュ", "ハッケツビョウ", "ヒホジキンリンパシュ", "あくせいりんぱしゅ", "はっけつびょう", "ひほじきんりんぱしゅ"],
    "originSynonyms": ["悪性リンパ腫", "白血病", "非ホジキンリンパ腫"]
}, {
    "name": "ホジキン病",
    "value": "ホジキン病",
    "synonyms": ["ホジキン病", "ホジキンビョウ", "ほじきんびょう"],
    "originSynonyms": ["ホジキン病"]
}, {
    "name": "胃がん",
    "value": "胃がん",
    "synonyms": ["胃がん", "大腸がん", "腎臓がん", "膀胱がん", "Ｓ状結腸がん", "直腸がん", "肛門がん", "膣がん", "精巣がん", "尿管がん", "イガン", "ダイチョウガン", "ジンゾウガン", "ボウコウガン", "エスジョウケッチョウガン", "チョクチョウガン", "コウモンガン", "チツガン", "セイソウガン", "ニョウカンガン", "いがん", "だいちょうがん", "じんぞうがん", "ぼうこうがん", "えすじょうけっちょうがん", "ちょくちょうがん", "こうもんがん", "ちつがん", "せいそうがん", "にょうかんがん", "胃ガン", "大腸ガン", "腎臓ガン", "膀胱ガン", "Ｓ状結腸ガン", "直腸ガン", "肛門ガン", "膣ガン", "精巣ガン", "尿管ガン", "胃癌", "大腸癌", "腎臓癌", "膀胱癌", "Ｓ状結腸癌", "直腸癌", "肛門癌", "膣癌", "精巣癌", "尿管癌"],
    "originSynonyms": ["胃がん", "大腸がん", "腎臓がん", "膀胱がん", "Ｓ状結腸がん", "直腸がん", "肛門がん", "膣がん", "精巣がん", "尿管がん"]
}, {
    "name": "子宮頸がん",
    "value": "子宮頸がん",
    "synonyms": ["子宮頸がん", "シキュウケイガン", "しきゅうけいがん", "子宮頸ガン", "子宮頸癌"],
    "originSynonyms": ["子宮頸がん"]
}, {
    "name": "子宮がん",
    "value": "子宮がん",
    "synonyms": ["子宮がん", "子宮体がん", "シキュウガン", "シキュウタイガン", "しきゅうがん", "しきゅうたいがん", "子宮ガン", "子宮体ガン", "子宮癌", "子宮体癌"],
    "originSynonyms": ["子宮がん", "子宮体がん"]
}, {
    "name": "甲状腺がん",
    "value": "甲状腺がん",
    "synonyms": ["甲状腺がん", "コウジョウセンガン", "こうじょうせんがん", "甲状腺ガン", "甲状腺癌"],
    "originSynonyms": ["甲状腺がん"]
}, {
    "name": "前立腺がん",
    "value": "前立腺がん",
    "synonyms": ["前立腺がん", "ゼンリツセンガン", "ぜんりつせんがん", "前立腺ガン", "前立腺癌"],
    "originSynonyms": ["前立腺がん"]
}, {
    "name": "喉頭がん",
    "value": "喉頭がん",
    "synonyms": ["喉頭がん", "咽頭がん", "舌がん", "コウトウガン", "イントウガン", "ゼツガン", "こうとうがん", "いんとうがん", "ぜつがん", "喉頭ガン", "咽頭ガン", "舌ガン", "喉頭癌", "咽頭癌", "舌癌"],
    "originSynonyms": ["喉頭がん", "咽頭がん", "舌がん"]
}, {
    "name": "皮膚がん(悪性黒色腫を除く)",
    "value": "皮膚がん(悪性黒色腫を除く)",
    "synonyms": ["皮膚がん(悪性黒色腫を除く)", "ヒフガン(アクセイコクショクシュヲノゾク)", "ひふがん(あくせいこくしょくしゅをのぞく)", "皮膚がん", "皮膚ガン", "ヒフガン", "ひふがん", "皮膚癌", "皮膚癌(悪性黒色腫を除く)"],
    "originSynonyms": ["皮膚がん(悪性黒色腫を除く)"]
}, {
    "name": "網膜芽細胞腫",
    "value": "網膜芽細胞腫",
    "synonyms": ["網膜芽細胞腫", "肉腫", "悪性黒色腫", "悪性メラノーマ", "悪性絨毛上皮腫", "モウマクガサイボウシュ", "ニクシュ", "アクセイコクショクシュ", "アクセイメラノーマ", "アクセイジュウモウジョウヒシュ", "もうまくがさいぼうしゅ", "にくしゅ", "あくせいこくしょくしゅ", "あくせいめらのーま", "あくせいじゅうもうじょうひしゅ"],
    "originSynonyms": ["網膜芽細胞腫", "肉腫", "悪性黒色腫", "悪性メラノーマ", "悪性絨毛上皮腫"]
}, {
    "name": "乳房上皮内がん",
    "value": "乳房上皮内がん",
    "synonyms": ["乳房上皮内がん", "乳房非浸潤がん", "ニュウボウジョウヒナイガン", "ニュウボウヒシンジュンガン", "にゅうぼうじょうひないがん", "にゅうぼうひしんじゅんがん", "乳房上皮内ガン", "乳房非浸潤ガン", "乳房上皮内癌", "乳房非浸潤癌"],
    "originSynonyms": ["乳房上皮内がん", "乳房非浸潤がん"]
}, {
    "name": "胃上皮内がん",
    "value": "胃上皮内がん",
    "synonyms": ["胃上皮内がん", "胃粘膜内がん", "イジョウヒナイガン", "イネンマクナイガン", "いじょうひないがん", "いねんまくないがん", "胃上皮内ガン", "胃粘膜内ガン", "胃上皮内癌", "胃粘膜内癌"],
    "originSynonyms": ["胃上皮内がん", "胃粘膜内がん"]
}, {
    "name": "大腸粘膜内（上皮内）がん",
    "value": "大腸粘膜内（上皮内）がん",
    "synonyms": ["大腸粘膜内（上皮内）がん", "直腸粘膜内（上皮内）がん", "結腸粘膜内（上皮内）がん", "S状結腸粘膜内（上皮内）がん", "ダイチョウネンマクナイ（ジョウヒナイ）ガン", "チョクチョウネンマクナイ（ジョウヒナイ）ガン", "ケッチョウネンマクナイ（ジョウヒナイ）ガン", "Sジョウケッチョウネンマクナイ（ジョウヒナイ）ガン", "だいちょうねんまくない（じょうひない）がん", "ちょくちょうねんまくない（じょうひない）がん", "けっちょうねんまくない（じょうひない）がん", "Sじょうけっちょうねんまくない（じょうひない）がん", "大腸粘膜内がん", "直腸粘膜内がん", "結腸粘膜内がん", "S状結腸粘膜内がん", "ダイチョウネンマクナイガン", "チョクチョウネンマクナイガン", "ケッチョウネンマクナイガン", "Sジョウケッチョウネンマクナイガン", "だいちょうねんまくないがん", "ちょくちょうねんまくないがん", "けっちょうねんまくないがん", "Sじょうけっちょうねんまくないがん", "大腸粘膜内癌", "直腸粘膜内癌", "結腸粘膜内癌", "S状結腸粘膜内癌", "大腸粘膜内ガン", "直腸粘膜内ガン", "結腸粘膜内ガン", "S状結腸粘膜内ガン", "大腸粘膜内（上皮内）癌", "直腸粘膜内（上皮内）癌", "結腸粘膜内（上皮内）癌", "S状結腸粘膜内（上皮内）癌"],
    "originSynonyms": ["大腸粘膜内（上皮内）がん", "直腸粘膜内（上皮内）がん", "結腸粘膜内（上皮内）がん", "S状結腸粘膜内（上皮内）がん"]
}, {
    "name": "白板症",
    "value": "白板症",
    "synonyms": ["白板症", "ハクバンショウ", "はくばんしょう"],
    "originSynonyms": ["白板症"]
}, {
    "name": "カルチノイド",
    "value": "カルチノイド",
    "synonyms": ["カルチノイド", "GIST", "ジスト", "かるちのいど", "じすと"],
    "originSynonyms": ["カルチノイド", "GIST"]
}, {
    "name": "喉頭ポリープ",
    "value": "喉頭ポリープ",
    "synonyms": ["喉頭ポリープ", "コウトウポリープ", "こうとうぽりーぷ"],
    "originSynonyms": ["喉頭ポリープ"]
}, {
    "name": "声帯ポリープ",
    "value": "声帯ポリープ",
    "synonyms": ["声帯ポリープ", "セイタイポリープ", "せいたいぽりーぷ"],
    "originSynonyms": ["声帯ポリープ"]
}, {
    "name": "胃ポリープ",
    "value": "胃ポリープ",
    "synonyms": ["胃ポリープ", "十二指腸ポリープ", "イポリープ", "ジュウニシチョウポリープ", "いぽりーぷ", "じゅうにしちょうぽりーぷ"],
    "originSynonyms": ["胃ポリープ", "十二指腸ポリープ"]
}, {
    "name": "胆嚢ポリープ",
    "value": "胆嚢ポリープ",
    "synonyms": ["胆嚢ポリープ", "タンノウポリープ", "たんのうぽりーぷ", "胆のうポリープ"],
    "originSynonyms": ["胆嚢ポリープ"]
}, {
    "name": "大腸ポリープ",
    "value": "大腸ポリープ",
    "synonyms": ["大腸ポリープ", "結腸ポリープ", "Ｓ状結腸ポリープ", "ダイチョウポリープ", "ケッチョウポリープ", "Ｓジョウケッチョウポリープ", "だいちょうぽりーぷ", "けっちょうぽりーぷ", "Ｓじょうけっちょうぽりーぷ"],
    "originSynonyms": ["大腸ポリープ", "結腸ポリープ", "Ｓ状結腸ポリープ"]
}, {
    "name": "膀胱ポリープ",
    "value": "膀胱ポリープ",
    "synonyms": ["膀胱ポリープ", "ボウコウポリープ", "ぼうこうぽりーぷ"],
    "originSynonyms": ["膀胱ポリープ"]
}, {
    "name": "子宮頸管ポリープ",
    "value": "子宮頸管ポリープ",
    "synonyms": ["子宮頸管ポリープ", "シキュウケイカンポリープ", "しきゅうけいかんぽりーぷ", "子宮頚管ポリープ"],
    "originSynonyms": ["子宮頸管ポリープ"]
}, {
    "name": "子宮ポリープ",
    "value": "子宮ポリープ",
    "synonyms": ["子宮ポリープ", "子宮内膜ポリープ", "シキュウポリープ", "シキュウナイマクポリープ", "しきゅうぽりーぷ", "しきゅうないまくぽりーぷ"],
    "originSynonyms": ["子宮ポリープ", "子宮内膜ポリープ"]
}, {
    "name": "直腸ポリープ",
    "value": "直腸ポリープ",
    "synonyms": ["直腸ポリープ", "チョクチョウポリープ", "ちょくちょうぽりーぷ"],
    "originSynonyms": ["直腸ポリープ"]
}, {
    "name": "子宮筋腫",
    "value": "子宮筋腫",
    "synonyms": ["子宮筋腫", "シキュウキンシュ", "しきゅうきんしゅ"],
    "originSynonyms": ["子宮筋腫"]
}, {
    "name": "卵巣のう腫",
    "value": "卵巣のう腫",
    "synonyms": ["卵巣のう腫", "卵巣のう胞", "ランソウノウシュ", "ランソウノウホウ", "らんそうのうしゅ", "らんそうのうほう", "卵巣嚢腫", "卵巣嚢胞"],
    "originSynonyms": ["卵巣のう腫", "卵巣のう胞"]
}, {
    "name": "乳腺線維腫",
    "value": "乳腺線維腫",
    "synonyms": ["乳腺線維腫", "乳房の良性腫瘍", "乳腺の良性腫瘍", "乳腺のう胞", "乳房石灰化", "乳腺石灰化", "乳房腫瘤", "乳腺腫瘤", "ニュウセンセンイシュ", "ニュウボウノリョウセイシュヨウ", "ニュウセンノリョウセイシュヨウ", "ニュウセンノウホウ", "ニュウボウセッカイカ", "ニュウセンセッカイカ", "ニュウボウシュリュウ", "ニュウセンシュリュウ", "にゅうせんせんいしゅ", "にゅうぼうのりょうせいしゅよう", "にゅうせんのりょうせいしゅよう", "にゅうせんのうほう", "にゅうぼうせっかいか", "にゅうせんせっかいか", "にゅうぼうしゅりゅう", "にゅうせんしゅりゅう"],
    "originSynonyms": ["乳腺線維腫", "乳房の良性腫瘍", "乳腺の良性腫瘍", "乳腺のう胞", "乳房石灰化", "乳腺石灰化", "乳房腫瘤", "乳腺腫瘤"]
}, {
    "name": "脂肪腫",
    "value": "脂肪腫",
    "synonyms": ["脂肪腫", "シボウシュ", "しぼうしゅ"],
    "originSynonyms": ["脂肪腫"]
}, {
    "name": "骨腫",
    "value": "骨腫",
    "synonyms": ["骨腫", "軟骨腫", "コツシュ", "ナンコツシュ", "こつしゅ", "なんこつしゅ"],
    "originSynonyms": ["骨腫", "軟骨腫"]
}, {
    "name": "骨軟骨腫",
    "value": "骨軟骨腫",
    "synonyms": ["骨軟骨腫", "外骨腫", "コツナンコツシュ", "ガイコツシュ", "こつなんこつしゅ", "がいこつしゅ"],
    "originSynonyms": ["骨軟骨腫", "外骨腫"]
}, {
    "name": "下垂体腺腫",
    "value": "下垂体腺腫",
    "synonyms": ["下垂体腺腫", "髄膜腫", "カスイタイセンシュ", "ズイマクシュ", "かすいたいせんしゅ", "ずいまくしゅ"],
    "originSynonyms": ["下垂体腺腫", "髄膜腫"]
}, {
    "name": "脳腫瘍",
    "value": "脳腫瘍",
    "synonyms": ["脳腫瘍", "ノウシュヨウ", "のうしゅよう"],
    "originSynonyms": ["脳腫瘍"]
}, {
    "name": "唾液腺腫瘍",
    "value": "唾液腺腫瘍",
    "synonyms": ["唾液腺腫瘍", "顎下腺腫瘍", "耳下腺腫瘍", "舌下腺腫瘍", "ダエキセンシュヨウ", "ガクカセンシュヨウ", "ジカセンシュヨウ", "ゼッカセンシュヨウ", "だえきせんしゅよう", "がくかせんしゅよう", "じかせんしゅよう", "ぜっかせんしゅよう"],
    "originSynonyms": ["唾液腺腫瘍", "顎下腺腫瘍", "耳下腺腫瘍", "舌下腺腫瘍"]
}]
var c = [{
    "name": "ぜんそく",
    "value": "ぜんそく",
    "synonyms": ["ぜんそく", "喘息", "気管支喘息", "ゼンソク", "キカンシゼンソク", "きかんしぜんそく"],
    "originSynonyms": ["ぜんそく", "喘息", "気管支喘息"]
}, {
    "name": "咳ぜんそく",
    "value": "咳ぜんそく",
    "synonyms": ["咳ぜんそく", "咳喘息", "セキゼンソク", "せきぜんそく"],
    "originSynonyms": ["咳ぜんそく", "咳喘息"]
}, {
    "name": "甲状腺腫",
    "value": "甲状腺腫",
    "synonyms": ["甲状腺腫", "瀰漫性甲状腺腫", "結節性甲状腺腫", "コウジョウセンシュ", "ビマンセイコウジョウセンシュ", "ケッセツセイコウジョウセンシュ", "こうじょうせんしゅ", "びまんせいこうじょうせんしゅ", "けっせつせいこうじょうせんしゅ", "びまん性甲状腺腫"],
    "originSynonyms": ["甲状腺腫", "瀰漫性甲状腺腫", "結節性甲状腺腫"]
}, {
    "name": "甲状腺機能亢進症",
    "value": "甲状腺機能亢進症",
    "synonyms": ["甲状腺機能亢進症", "バセドウ病", "グレーブス病", "コウジョウセンキノウコウシンショウ", "バセドウビョウ", "グレーブスビョウ", "こうじょうせんきのうこうしんしょう", "ばせどうびょう", "ぐれーぶすびょう"],
    "originSynonyms": ["甲状腺機能亢進症", "バセドウ病", "グレーブス病"]
}, {
    "name": "甲状腺機能低下症",
    "value": "甲状腺機能低下症",
    "synonyms": ["甲状腺機能低下症", "慢性甲状腺炎", "橋本病", "コウジョウセンキノウテイカショウ", "マンセイコウジョウセンエン", "ハシモトビョウ", "こうじょうせんきのうていかしょう", "まんせいこうじょうせんえん", "はしもとびょう"],
    "originSynonyms": ["甲状腺機能低下症", "慢性甲状腺炎", "橋本病"]
}, {
    "name": "痛風",
    "value": "痛風",
    "synonyms": ["痛風", "高尿酸血症", "ツウフウ", "コウニョウサンケッショウ", "つうふう", "こうにょうさんけっしょう"],
    "originSynonyms": ["痛風", "高尿酸血症"]
}, {
    "name": "糖尿病",
    "value": "糖尿病",
    "synonyms": ["糖尿病", "境界型糖尿病", "HbA1c（ヘモグロビンA1c）値", "トウニョウビョウ", "キョウカイガタトウニョウビョウ", "HbA1c（ヘモグロビンA1c）チ", "とうにょうびょう", "きょうかいがたとうにょうびょう", "HbA1c（へもぐろびんA1c）ち", "ヘモグロビンエーワンシーチ", "へもぐろびんえーわんしーち"],
    "originSynonyms": ["糖尿病", "境界型糖尿病", "HbA1c（ヘモグロビンA1c）値"]
}, {
    "name": "血糖値（空腹時血糖）",
    "value": "血糖値（空腹時血糖）",
    "synonyms": ["血糖値（空腹時血糖）", "ケットウチ（クウフクジケットウ）", "けっとうち（くうふくじけっとう）", "血糖値", "ケットウチ", "けっとうち"],
    "originSynonyms": ["血糖値（空腹時血糖）"]
}, {
    "name": "尿糖",
    "value": "尿糖",
    "synonyms": ["尿糖", "ニョウトウ", "にょうとう"],
    "originSynonyms": ["尿糖"]
}, {
    "name": "高脂血症",
    "value": "高脂血症",
    "synonyms": ["高脂血症", "高コレステロール血症", "脂質異常症", "コウシケッショウ", "コウコレステロールケツショウ", "シシツイジョウショウ", "こうしけっしょう", "こうこれすてろーるけつしょう", "ししついじょうしょう"],
    "originSynonyms": ["高脂血症", "高コレステロール血症", "脂質異常症"]
}]
var d = [{
    "name": "貧血",
    "value": "貧血",
    "synonyms": ["貧血", "鉄欠乏性貧血", "ヘモグロビン", "Hb", "ヒンケツ", "テツケツボウセイヒンケツ", "ひんけつ", "てつけつぼうせいひんけつ", "へもぐろびん"],
    "originSynonyms": ["貧血", "鉄欠乏性貧血", "ヘモグロビン", "Hb"]
}, {
    "name": "悪性貧血",
    "value": "悪性貧血",
    "synonyms": ["悪性貧血", "巨赤芽球貧血", "再生不良性貧血", "溶血性貧血", "アクセイヒンケツ", "キョセキガキュウヒンケツ", "サイセイフリョウセイヒンケツ", "ヨウケツセイヒンケツ", "あくせいひんけつ", "きょせきがきゅうひんけつ", "さいせいふりょうせいひんけつ", "ようけつせいひんけつ"],
    "originSynonyms": ["悪性貧血", "巨赤芽球貧血", "再生不良性貧血", "溶血性貧血"]
}, {
    "name": "血小板減少性紫斑病",
    "value": "血小板減少性紫斑病",
    "synonyms": ["血小板減少性紫斑病", "ケッショウバンゲンショウセイシハンビョウ", "けっしょうばんげんしょうせいしはんびょう"],
    "originSynonyms": ["血小板減少性紫斑病"]
}, {
    "name": "血友病",
    "value": "血友病",
    "synonyms": ["血友病", "ケツユウビョウ", "けつゆうびょう"],
    "originSynonyms": ["血友病"]
}]
var e = [{
    "name": "統合失調症",
    "value": "統合失調症",
    "synonyms": ["統合失調症", "トウゴウシッチョウショウ", "とうごうしっちょうしょう"],
    "originSynonyms": ["統合失調症"]
}, {
    "name": "てんかん",
    "value": "てんかん",
    "synonyms": ["てんかん", "テンカン"],
    "originSynonyms": ["てんかん"]
}, {
    "name": "うつ病",
    "value": "うつ病",
    "synonyms": ["うつ病", "仮面うつ病", "ウツビョウ", "カメンウツビョウ", "うつびょう", "かめんうつびょう", "ウツ病", "仮面ウツ病", "鬱病", "仮面鬱病"],
    "originSynonyms": ["うつ病", "仮面うつ病"]
}, {
    "name": "双極性障害",
    "value": "双極性障害",
    "synonyms": ["双極性障害", "躁病", "躁鬱病", "ソウキョクセイショウガイ", "ソウビョウ", "ソウウツビョウ", "そうきょくせいしょうがい", "そうびょう", "そううつびょう"],
    "originSynonyms": ["双極性障害", "躁病", "躁鬱病"]
}, {
    "name": "パニック障害",
    "value": "パニック障害",
    "synonyms": ["パニック障害", "神経症", "不安神経症", "社会不安障害", "パニックショウガイ", "シンケイショウ", "フアンシンケイショウ", "シャカイフアンショウガイ", "ぱにっくしょうがい", "しんけいしょう", "ふあんしんけいしょう", "しゃかいふあんしょうがい"],
    "originSynonyms": ["パニック障害", "神経症", "不安神経症", "社会不安障害"]
}, {
    "name": "不眠症",
    "value": "不眠症",
    "synonyms": ["不眠症", "フミンショウ", "ふみんしょう"],
    "originSynonyms": ["不眠症"]
}, {
    "name": "自律神経失調症",
    "value": "自律神経失調症",
    "synonyms": ["自律神経失調症", "ジリツシンケイシッチョウショウ", "じりつしんけいしっちょうしょう"],
    "originSynonyms": ["自律神経失調症"]
}, {
    "name": "適応障害",
    "value": "適応障害",
    "synonyms": ["適応障害", "テキオウショウガイ", "てきおうしょうがい"],
    "originSynonyms": ["適応障害"]
}, {
    "name": "脳梗塞",
    "value": "脳梗塞",
    "synonyms": ["脳梗塞", "脳出血", "アテローム血栓性脳梗塞", "脳塞栓", "脳血栓", "ノウコウソク", "ノウシュッケツ", "アテロームケッセンセイノウコウソク", "ノウソクセン", "ノウケッセン", "のうこうそく", "のうしゅっけつ", "あてろーむけっせんせいのうこうそく", "のうそくせん", "のうけっせん"],
    "originSynonyms": ["脳梗塞", "脳出血", "アテローム血栓性脳梗塞", "脳塞栓", "脳血栓"]
}, {
    "name": "ラクナ梗塞",
    "value": "ラクナ梗塞",
    "synonyms": ["ラクナ梗塞", "ラクナコウソク", "らくなこうそく"],
    "originSynonyms": ["ラクナ梗塞"]
}, {
    "name": "一過性脳虚血発作",
    "value": "一過性脳虚血発作",
    "synonyms": ["一過性脳虚血発作", "椎骨脳底動脈循環不全", "イッカセイノウキョケツホッサ", "ツイコツノウテイドウミャクジュンカンフゼン", "いっかせいのうきょけつほっさ", "ついこつのうていどうみゃくじゅんかんふぜん"],
    "originSynonyms": ["一過性脳虚血発作", "椎骨脳底動脈循環不全"]
}, {
    "name": "くも膜下出血",
    "value": "くも膜下出血",
    "synonyms": ["くも膜下出血", "破裂脳動脈瘤", "クモマクカシュッケツ", "ハレツノウドウミャクリュウ", "くもまくかしゅっけつ", "はれつのうどうみゃくりゅう"],
    "originSynonyms": ["くも膜下出血", "破裂脳動脈瘤"]
}, {
    "name": "認知症",
    "value": "認知症",
    "synonyms": ["認知症", "アルツハイマー病", "ニンチショウ", "アルツハイマービョウ", "にんちしょう", "あるつはいまーびょう"],
    "originSynonyms": ["認知症", "アルツハイマー病"]
}, {
    "name": "めまい",
    "value": "めまい",
    "synonyms": ["めまい", "めまい症", "良性発作性めまい", "頭位めまい症", "メマイ", "メマイショウ", "リョウセイホッサセイメマイ", "トウイメマイショウ", "めまいしょう", "りょうせいほっさせいめまい", "とういめまいしょう"],
    "originSynonyms": ["めまい", "めまい症", "良性発作性めまい", "頭位めまい症"]
}, {
    "name": "頭痛",
    "value": "頭痛",
    "synonyms": ["頭痛", "片頭痛", "偏頭痛", "ズツウ", "ヘンズツウ", "ヘンズツウ", "ずつう", "へんずつう", "へんずつう"],
    "originSynonyms": ["頭痛", "片頭痛", "偏頭痛"]
}, {
    "name": "熱性けいれん",
    "value": "熱性けいれん",
    "synonyms": ["熱性けいれん", "ネッセイケイレン", "ねっせいけいれん", "ネツセイケイレン", "ねつせいけいれん"],
    "originSynonyms": ["熱性けいれん"]
}, {
    "name": "睡眠時無呼吸症候群",
    "value": "睡眠時無呼吸症候群",
    "synonyms": ["睡眠時無呼吸症候群", "スイミンジムコキュウショウコウグン", "すいみんじむこきゅうしょうこうぐん"],
    "originSynonyms": ["睡眠時無呼吸症候群"]
}, {
    "name": "脊髄炎",
    "value": "脊髄炎",
    "synonyms": ["脊髄炎", "セキズイエン", "せきずいえん"],
    "originSynonyms": ["脊髄炎"]
}, {
    "name": "多発性硬化症",
    "value": "多発性硬化症",
    "synonyms": ["多発性硬化症", "パーキンソン病", "タハツセイコウカショウ", "パーキンソンビョウ", "たはつせいこうかしょう", "ぱーきんそんびょう"],
    "originSynonyms": ["多発性硬化症", "パーキンソン病"]
}, {
    "name": "ぎっくり腰",
    "value": "ぎっくり腰",
    "synonyms": ["ぎっくり腰", "坐骨神経痛", "腰痛", "ギックリゴシ", "ザコツシンケイツウ", "ヨウツウ", "ぎっくりごし", "ざこつしんけいつう", "ようつう"],
    "originSynonyms": ["ぎっくり腰", "坐骨神経痛", "腰痛"]
}, {
    "name": "脊椎すべり症(頚椎）",
    "value": "脊椎すべり症(頚椎）",
    "synonyms": ["脊椎すべり症(頚椎）", "椎間板ヘルニア（頚椎）", "頚椎症", "セキツイスベリショウ(ケイツイ）", "ツイカンバンヘルニア（ケイツイ）", "ケイツイショウ", "せきついすべりしょう(けいつい）", "ついかんばんへるにあ（けいつい）", "けいついしょう", "せきついすべりしょう", "ついかんばんへるにあ", "セキツイスベリショウ", "ツイカンバンヘルニア"],
    "originSynonyms": ["脊椎すべり症(頚椎）", "椎間板ヘルニア（頚椎）", "頚椎症"]
}, {
    "name": "脊椎すべり症(腰椎）",
    "value": "脊椎すべり症(腰椎）",
    "synonyms": ["脊椎すべり症(腰椎）", "椎間板ヘルニア（腰椎）", "セキツイスベリショウ(ヨウツイ）", "ツイカンバンヘルニア（ヨウツイ）", "せきついすべりしょう(ようつい）", "ついかんばんへるにあ（ようつい）", "セキツイスベリショウ", "ツイカンバンヘルニア", "せきついすべりしょう", "ついかんばんへるにあ"],
    "originSynonyms": ["脊椎すべり症(腰椎）", "椎間板ヘルニア（腰椎）"]
}, {
    "name": "顔面神経麻痺",
    "value": "顔面神経麻痺",
    "synonyms": ["顔面神経麻痺", "ベル麻痺", "ガンメンシンケイマヒ", "ベルマヒ", "がんめんしんけいまひ", "べるまひ"],
    "originSynonyms": ["顔面神経麻痺", "ベル麻痺"]
}, {
    "name": "ギランバレー症候群",
    "value": "ギランバレー症候群",
    "synonyms": ["ギランバレー症候群", "フィッシャー症候群", "ハント症候群", "ギランバレーショウコウグン", "フィッシャーショウコウグン", "ハントショウコウグン", "ぎらんばれーしょうこうぐん", "ふぃっしゃーしょうこうぐん", "はんとしょうこうぐん"],
    "originSynonyms": ["ギランバレー症候群", "フィッシャー症候群", "ハント症候群"]
}]
var f = [{
    "name": "網膜はく離",
    "value": "網膜はく離",
    "synonyms": ["網膜はく離", "網膜裂孔", "硝子体剥離", "黄斑円孔", "モウマクハクリ", "モウマクレッコウ", "ショウシタイハクリ", "オウハンエンコウ", "もうまくはくり", "もうまくれっこう", "しょうしたいはくり", "おうはんえんこう"],
    "originSynonyms": ["網膜はく離", "網膜裂孔", "硝子体剥離", "黄斑円孔"]
}, {
    "name": "白内障（外傷性）",
    "value": "白内障（外傷性）",
    "synonyms": ["白内障（外傷性）", "ハクナイショウ（ガイショウセイ）", "はくないしょう（がいしょうせい）"],
    "originSynonyms": ["白内障（外傷性）"]
}, {
    "name": "白内障（老人性・先天性）",
    "value": "白内障（老人性・先天性）",
    "synonyms": ["白内障（老人性・先天性）", "ハクナイショウ（ロウジンセイ・センテンセイ）", "はくないしょう（ろうじんせい・せんてんせい）"],
    "originSynonyms": ["白内障（老人性・先天性）"]
}, {
    "name": "白内障（糖尿病性）",
    "value": "白内障（糖尿病性）",
    "synonyms": ["白内障（糖尿病性）", "ハクナイショウ（トウニョウビョウセイ）", "はくないしょう（とうにょうびょうせい）"],
    "originSynonyms": ["白内障（糖尿病性）"]
}, {
    "name": "緑内障",
    "value": "緑内障",
    "synonyms": ["緑内障", "先天性緑内障", "高眼圧症", "リョクナイショウ", "センテンセイリョクナイショウ", "コウガンアツショウ", "りょくないしょう", "せんてんせいりょくないしょう", "こうがんあつしょう"],
    "originSynonyms": ["緑内障", "先天性緑内障", "高眼圧症"]
}, {
    "name": "原田病",
    "value": "原田病",
    "synonyms": ["原田病", "ぶどう膜炎", "虹彩炎", "虹彩毛様体炎", "ハラダビョウ", "ブドウマクエン", "コウサイエン", "コウサイモウヨウタイエン", "はらだびょう", "ぶどうまくえん", "こうさいえん", "こうさいもうようたいえん"],
    "originSynonyms": ["原田病", "ぶどう膜炎", "虹彩炎", "虹彩毛様体炎"]
}, {
    "name": "結膜炎",
    "value": "結膜炎",
    "synonyms": ["結膜炎", "ものもらい", "麦粒腫", "ケツマクエン", "モノモライ", "バクリュウシュ", "けつまくえん", "ばくりゅうしゅ"],
    "originSynonyms": ["結膜炎", "ものもらい", "麦粒腫"]
}, {
    "name": "ドライアイ",
    "value": "ドライアイ",
    "synonyms": ["ドライアイ", "どらいあい"],
    "originSynonyms": ["ドライアイ"]
}, {
    "name": "レーシック",
    "value": "レーシック",
    "synonyms": ["レーシック", "れーしっく"],
    "originSynonyms": ["レーシック"]
}, {
    "name": "翼状片",
    "value": "翼状片",
    "synonyms": ["翼状片", "ヨクジョウヘン", "よくじょうへん"],
    "originSynonyms": ["翼状片"]
}, {
    "name": "眼瞼下垂",
    "value": "眼瞼下垂",
    "synonyms": ["眼瞼下垂", "斜視", "ガンケンカスイ", "シャシ", "がんけんかすい", "しゃし"],
    "originSynonyms": ["眼瞼下垂", "斜視"]
}, {
    "name": "加齢黄斑変性",
    "value": "加齢黄斑変性",
    "synonyms": ["加齢黄斑変性", "カレイオウハンヘンセイ", "かれいおうはんへんせい"],
    "originSynonyms": ["加齢黄斑変性"]
}, {
    "name": "網膜静脈閉塞症",
    "value": "網膜静脈閉塞症",
    "synonyms": ["網膜静脈閉塞症", "網膜動脈閉塞症", "モウマクジョウミャクヘイソクショウ", "モウマクドウミャクヘイソクショウ", "もうまくじょうみゃくへいそくしょう", "もうまくどうみゃくへいそくしょう"],
    "originSynonyms": ["網膜静脈閉塞症", "網膜動脈閉塞症"]
}, {
    "name": "網膜色素変性症",
    "value": "網膜色素変性症",
    "synonyms": ["網膜色素変性症", "モウマクシキソヘンセイショウ", "もうまくしきそへんせいしょう"],
    "originSynonyms": ["網膜色素変性症"]
}, {
    "name": "急性中耳炎",
    "value": "急性中耳炎",
    "synonyms": ["急性中耳炎", "キュウセイチュウジエン", "きゅうせいちゅうじえん"],
    "originSynonyms": ["急性中耳炎"]
}, {
    "name": "真珠腫性中耳炎",
    "value": "真珠腫性中耳炎",
    "synonyms": ["真珠腫性中耳炎", "慢性中耳炎", "シンジュシュセイチュウジエン", "マンセイチュウジエン", "しんじゅしゅせいちゅうじえん", "まんせいちゅうじえん"],
    "originSynonyms": ["真珠腫性中耳炎", "慢性中耳炎"]
}, {
    "name": "メニエール病",
    "value": "メニエール病",
    "synonyms": ["メニエール病", "メニエールビョウ", "めにえーるびょう"],
    "originSynonyms": ["メニエール病"]
}, {
    "name": "難聴",
    "value": "難聴",
    "synonyms": ["難聴", "ナンチョウ", "なんちょう"],
    "originSynonyms": ["難聴"]
}, {
    "name": "突発性難聴",
    "value": "突発性難聴",
    "synonyms": ["突発性難聴", "トッパツセイナンチョウ", "とっぱつせいなんちょう"],
    "originSynonyms": ["突発性難聴"]
}]
var g = [{
    "name": "心肥大",
    "value": "心肥大",
    "synonyms": ["心肥大", "シンヒダイ", "しんひだい"],
    "originSynonyms": ["心肥大"]
}, {
    "name": "高血圧症",
    "value": "高血圧症",
    "synonyms": ["高血圧症", "コウケツアツショウ", "こうけつあつしょう"],
    "originSynonyms": ["高血圧症"]
}, {
    "name": "不整脈（期外収縮）",
    "value": "不整脈（期外収縮）",
    "synonyms": ["不整脈（期外収縮）", "フセイミャク（キガイシュウシュク）", "ふせいみゃく（きがいしゅうしゅく）"],
    "originSynonyms": ["不整脈（期外収縮）"]
}, {
    "name": "不整脈（脈拍異常）",
    "value": "不整脈（脈拍異常）",
    "synonyms": ["不整脈（脈拍異常）", "不整脈（頻脈）", "不整脈（徐脈）", "フセイミャク（ミャクハクイジョウ）", "フセイミャク（ヒンミャク）", "フセイミャク（ジョミャク）", "ふせいみゃく（みゃくはくいじょう）", "ふせいみゃく（ひんみゃく）", "ふせいみゃく（じょみゃく）"],
    "originSynonyms": ["不整脈（脈拍異常）", "不整脈（頻脈）", "不整脈（徐脈）"]
}, {
    "name": "冠状動脈硬化",
    "value": "冠状動脈硬化",
    "synonyms": ["冠状動脈硬化", "カンジョウドウミャクコウカ", "かんじょうどうみゃくこうか"],
    "originSynonyms": ["冠状動脈硬化"]
}, {
    "name": "末梢動脈硬化",
    "value": "末梢動脈硬化",
    "synonyms": ["末梢動脈硬化", "マッショウドウミャクコウカ", "まっしょうどうみゃくこうか"],
    "originSynonyms": ["末梢動脈硬化"]
}, {
    "name": "狭心症",
    "value": "狭心症",
    "synonyms": ["狭心症", "キョウシンショウ", "きょうしんしょう"],
    "originSynonyms": ["狭心症"]
}, {
    "name": "心筋梗塞",
    "value": "心筋梗塞",
    "synonyms": ["心筋梗塞", "心筋症", "シンキンコウソク", "シンキンショウ", "しんきんこうそく", "しんきんしょう"],
    "originSynonyms": ["心筋梗塞", "心筋症"]
}, {
    "name": "心房中隔欠損症",
    "value": "心房中隔欠損症",
    "synonyms": ["心房中隔欠損症", "シンボウチュウカクケッソンショウ", "しんぼうちゅうかくけっそんしょう"],
    "originSynonyms": ["心房中隔欠損症"]
}, {
    "name": "心室中隔欠損症",
    "value": "心室中隔欠損症",
    "synonyms": ["心室中隔欠損症", "シンシツチュウカクケッソンショウ", "しんしつちゅうかくけっそんしょう"],
    "originSynonyms": ["心室中隔欠損症"]
}, {
    "name": "心筋炎",
    "value": "心筋炎",
    "synonyms": ["心筋炎", "シンキンエン", "しんきんえん"],
    "originSynonyms": ["心筋炎"]
}, {
    "name": "急性リウマチ熱",
    "value": "急性リウマチ熱",
    "synonyms": ["急性リウマチ熱", "キュウセイリウマチネツ", "きゅうせいりうまちねつ"],
    "originSynonyms": ["急性リウマチ熱"]
}, {
    "name": "心臓弁膜症",
    "value": "心臓弁膜症",
    "synonyms": ["心臓弁膜症", "シンゾウベンマクショウ", "しんぞうべんまくしょう"],
    "originSynonyms": ["心臓弁膜症"]
}, {
    "name": "僧帽弁膜症",
    "value": "僧帽弁膜症",
    "synonyms": ["僧帽弁膜症", "ソウボウベンマクショウ", "そうぼうべんまくしょう"],
    "originSynonyms": ["僧帽弁膜症"]
}, {
    "name": "先天性心臓病",
    "value": "先天性心臓病",
    "synonyms": ["先天性心臓病", "センテンセイシンゾウビョウ", "せんてんせいしんぞうびょう"],
    "originSynonyms": ["先天性心臓病"]
}, {
    "name": "心内膜炎",
    "value": "心内膜炎",
    "synonyms": ["心内膜炎", "シンナイマクエン", "しんないまくえん"],
    "originSynonyms": ["心内膜炎"]
}, {
    "name": "心膜炎",
    "value": "心膜炎",
    "synonyms": ["心膜炎", "心のう炎", "シンマクエン", "シンノウエン", "しんまくえん", "しんのうえん", "心嚢炎"],
    "originSynonyms": ["心膜炎", "心のう炎"]
}, {
    "name": "大動脈瘤",
    "value": "大動脈瘤",
    "synonyms": ["大動脈瘤", "ダイドウミャクリュウ", "だいどうみゃくりゅう"],
    "originSynonyms": ["大動脈瘤"]
}, {
    "name": "大動脈解離",
    "value": "大動脈解離",
    "synonyms": ["大動脈解離", "ダイドウミャクカイリ", "だいどうみゃくかいり"],
    "originSynonyms": ["大動脈解離"]
}, {
    "name": "川崎病",
    "value": "川崎病",
    "synonyms": ["川崎病", "カワサキビョウ", "かわさきびょう"],
    "originSynonyms": ["川崎病"]
}, {
    "name": "下肢静脈瘤",
    "value": "下肢静脈瘤",
    "synonyms": ["下肢静脈瘤", "下肢静脈怒張", "静脈炎", "カシジョウミャクリュウ", "カシジョウミャクドチョウ", "ジョウミャクエン", "かしじょうみゃくりゅう", "かしじょうみゃくどちょう", "じょうみゃくえん"],
    "originSynonyms": ["下肢静脈瘤", "下肢静脈怒張", "静脈炎"]
}, {
    "name": "下肢深部静脈血栓症",
    "value": "下肢深部静脈血栓症",
    "synonyms": ["下肢深部静脈血栓症", "エコノミークラス症候群", "静脈血栓塞栓症", "カシシンブジョウミャクケッセンショウ", "エコノミークラスショウコウグン", "ジョウミャクケッセンソクセンショウ", "かししんぶじょうみゃくけっせんしょう", "えこのみーくらすしょうこうぐん", "じょうみゃくけっせんそくせんしょう"],
    "originSynonyms": ["下肢深部静脈血栓症", "エコノミークラス症候群", "静脈血栓塞栓症"]
}, {
    "name": "発作性頻拍",
    "value": "発作性頻拍",
    "synonyms": ["発作性頻拍", "ホッサセイヒンパク", "ほっさせいひんぱく"],
    "originSynonyms": ["発作性頻拍"]
}, {
    "name": "心房細動",
    "value": "心房細動",
    "synonyms": ["心房細動", "心房粗動", "シンボウサイドウ", "シンボウソドウ", "しんぼうさいどう", "しんぼうそどう"],
    "originSynonyms": ["心房細動", "心房粗動"]
}, {
    "name": "ペースメーカーの埋め込み",
    "value": "ペースメーカーの埋め込み",
    "synonyms": ["ペースメーカーの埋め込み", "ペースメーカーノウメコミ", "ぺーすめーかーのうめこみ"],
    "originSynonyms": ["ペースメーカーの埋め込み"]
}]
var h = [{
    "name": "鼻茸",
    "value": "鼻茸",
    "synonyms": ["鼻茸", "鼻ポリープ", "ハナタケ", "ハナポリープ", "はなたけ", "はなぽりーぷ"],
    "originSynonyms": ["鼻茸", "鼻ポリープ"]
}, {
    "name": "アレルギー性鼻炎",
    "value": "アレルギー性鼻炎",
    "synonyms": ["アレルギー性鼻炎", "鼻炎", "花粉症", "アレルギーセイビエン", "ビエン", "カフンショウ", "あれるぎーせいびえん", "びえん", "かふんしょう"],
    "originSynonyms": ["アレルギー性鼻炎", "鼻炎", "花粉症"]
}, {
    "name": "蓄膿症",
    "value": "蓄膿症",
    "synonyms": ["蓄膿症", "副鼻腔炎", "チクノウショウ", "フクビクウエン", "ちくのうしょう", "ふくびくうえん"],
    "originSynonyms": ["蓄膿症", "副鼻腔炎"]
}, {
    "name": "鼻中隔彎曲症",
    "value": "鼻中隔彎曲症",
    "synonyms": ["鼻中隔彎曲症", "ビチュウカクワンキョクショウ", "びちゅうかくわんきょくしょう"],
    "originSynonyms": ["鼻中隔彎曲症"]
}, {
    "name": "アデノイド",
    "value": "アデノイド",
    "synonyms": ["アデノイド", "あでのいど"],
    "originSynonyms": ["アデノイド"]
}, {
    "name": "急性気管支炎",
    "value": "急性気管支炎",
    "synonyms": ["急性気管支炎", "気管支炎", "キュウセイキカンシエン", "キカンシエン", "きゅうせいきかんしえん", "きかんしえん"],
    "originSynonyms": ["急性気管支炎", "気管支炎"]
}, {
    "name": "扁桃炎",
    "value": "扁桃炎",
    "synonyms": ["扁桃炎", "扁桃周囲膿瘍", "ヘントウエン", "ヘントウシュウイノウヨウ", "へんとうえん", "へんとうしゅういのうよう"],
    "originSynonyms": ["扁桃炎", "扁桃周囲膿瘍"]
}, {
    "name": "咽頭炎",
    "value": "咽頭炎",
    "synonyms": ["咽頭炎", "喉頭炎", "イントウエン", "コウトウエン", "いんとうえん", "こうとうえん"],
    "originSynonyms": ["咽頭炎", "喉頭炎"]
}, {
    "name": "気管支拡張症",
    "value": "気管支拡張症",
    "synonyms": ["気管支拡張症", "キカンシカクチョウショウ", "きかんしかくちょうしょう"],
    "originSynonyms": ["気管支拡張症"]
}, {
    "name": "肺炎",
    "value": "肺炎",
    "synonyms": ["肺炎", "マイコプラズマ肺炎", "ハイエン", "マイコプラズマハイエン", "はいえん", "まいこぷらずまはいえん"],
    "originSynonyms": ["肺炎", "マイコプラズマ肺炎"]
}, {
    "name": "間質性肺炎",
    "value": "間質性肺炎",
    "synonyms": ["間質性肺炎", "カンシツセイハイエン", "かんしつせいはいえん"],
    "originSynonyms": ["間質性肺炎"]
}, {
    "name": "肺線維症",
    "value": "肺線維症",
    "synonyms": ["肺線維症", "ハイセンイショウ", "はいせんいしょう"],
    "originSynonyms": ["肺線維症"]
}, {
    "name": "気胸",
    "value": "気胸",
    "synonyms": ["気胸", "自然気胸", "肺気胸", "キキョウ", "シゼンキキョウ", "ハイキキョウ", "ききょう", "しぜんききょう", "はいききょう"],
    "originSynonyms": ["気胸", "自然気胸", "肺気胸"]
}, {
    "name": "外傷性気胸",
    "value": "外傷性気胸",
    "synonyms": ["外傷性気胸", "ガイショウセイキキョウ", "がいしょうせいききょう"],
    "originSynonyms": ["外傷性気胸"]
}, {
    "name": "COPD",
    "value": "COPD",
    "synonyms": ["COPD", "慢性閉塞性肺疾患", "肺気腫", "マンセイヘイソクセイハイシッカン", "ハイキシュ", "まんせいへいそくせいはいしっかん", "はいきしゅ", "シーオーピーディー", "しーおーぴーでぃー"],
    "originSynonyms": ["COPD", "慢性閉塞性肺疾患", "肺気腫"]
}, {
    "name": "慢性気管支炎",
    "value": "慢性気管支炎",
    "synonyms": ["慢性気管支炎", "マンセイキカンシエン", "まんせいきかんしえん"],
    "originSynonyms": ["慢性気管支炎"]
}]
var i = [{
    "name": "虫歯",
    "value": "虫歯",
    "synonyms": ["虫歯", "ムシバ", "むしば"],
    "originSynonyms": ["虫歯"]
}, {
    "name": "埋伏歯",
    "value": "埋伏歯",
    "synonyms": ["埋伏歯", "親知らず", "マイフクシ", "オヤシラズ", "まいふくし", "おやしらず"],
    "originSynonyms": ["埋伏歯", "親知らず"]
}, {
    "name": "口蓋裂",
    "value": "口蓋裂",
    "synonyms": ["口蓋裂", "口唇裂", "コウガイレツ", "コウシンレツ", "こうがいれつ", "こうしんれつ"],
    "originSynonyms": ["口蓋裂", "口唇裂"]
}, {
    "name": "下顎のう胞",
    "value": "下顎のう胞",
    "synonyms": ["下顎のう胞", "顎関節症", "カガクノウホウ", "ガクカンセツショウ", "かがくのうほう", "がくかんせつしょう"],
    "originSynonyms": ["下顎のう胞", "顎関節症"]
}, {
    "name": "唾石症",
    "value": "唾石症",
    "synonyms": ["唾石症", "ダセキショウ", "だせきしょう"],
    "originSynonyms": ["唾石症"]
}, {
    "name": "胃炎",
    "value": "胃炎",
    "synonyms": ["胃炎", "急性胃炎", "慢性胃炎", "萎縮性胃炎", "神経性胃炎", "肥厚性胃炎", "びらん性胃炎", "胃下垂", "胃酸過多症", "イエン", "キュウセイイエン", "マンセイイエン", "イシュクセイイエン", "シンケイセイイエン", "ヒコウセイイエン", "ビランセイイエン", "イカスイ", "イサンカタショウ", "いえん", "きゅうせいいえん", "まんせいいえん", "いしゅくせいいえん", "しんけいせいいえん", "ひこうせいいえん", "びらんせいいえん", "いかすい", "いさんかたしょう"],
    "originSynonyms": ["胃炎", "急性胃炎", "慢性胃炎", "萎縮性胃炎", "神経性胃炎", "肥厚性胃炎", "びらん性胃炎", "胃下垂", "胃酸過多症"]
}, {
    "name": "逆流性食道炎",
    "value": "逆流性食道炎",
    "synonyms": ["逆流性食道炎", "食道裂孔ヘルニア", "ギャクリュウセイショクドウエン", "ショクドウレッコウヘルニア", "ぎゃくりゅうせいしょくどうえん", "しょくどうれっこうへるにあ"],
    "originSynonyms": ["逆流性食道炎", "食道裂孔ヘルニア"]
}, {
    "name": "食道アカラジア",
    "value": "食道アカラジア",
    "synonyms": ["食道アカラジア", "ショクドウアカラジア", "しょくどうあからじあ", "食道アカラシア", "ショクドウアカラシア", "しょくどうあからしあ"],
    "originSynonyms": ["食道アカラジア"]
}, {
    "name": "虫垂炎",
    "value": "虫垂炎",
    "synonyms": ["虫垂炎", "チュウスイエン", "ちゅうすいえん"],
    "originSynonyms": ["虫垂炎"]
}, {
    "name": "胃かいよう",
    "value": "胃かいよう",
    "synonyms": ["胃かいよう", "十二指腸かいよう", "イカイヨウ", "ジュウニシチョウカイヨウ", "いかいよう", "じゅうにしちょうかいよう", "胃潰瘍", "十二指腸潰瘍"],
    "originSynonyms": ["胃かいよう", "十二指腸かいよう"]
}, {
    "name": "ヘリコバクターピロリ菌感染",
    "value": "ヘリコバクターピロリ菌感染",
    "synonyms": ["ヘリコバクターピロリ菌感染", "ヘリコバクターピロリ菌感染胃炎", "ピロリ菌感染胃炎", "ヘリコバクターピロリキン", "カンセン", "ヘリコバクターピロリキンカンセンイエン", "ピロリキンカンセンイエン", "へりこばくたーぴろりきん", "かんせん", "へりこばくたーぴろりきんかんせんいえん", "ぴろりきんかんせんいえん"],
    "originSynonyms": ["ヘリコバクターピロリ菌感染", "ヘリコバクターピロリ菌感染胃炎", "ピロリ菌感染胃炎"]
}, {
    "name": "腸重積",
    "value": "腸重積",
    "synonyms": ["腸重積", "チョウジュウセキ", "ちょうじゅうせき"],
    "originSynonyms": ["腸重積"]
}, {
    "name": "イレウス",
    "value": "イレウス",
    "synonyms": ["イレウス", "腸閉塞", "チョウヘイソク", "いれうす", "ちょうへいそく"],
    "originSynonyms": ["イレウス", "腸閉塞"]
}, {
    "name": "急性腸炎",
    "value": "急性腸炎",
    "synonyms": ["急性腸炎", "急性大腸炎", "キュウセイチョウエン", "キュウセイダイチョウエン", "きゅうせいちょうえん", "きゅうせいだいちょうえん"],
    "originSynonyms": ["急性腸炎", "急性大腸炎"]
}, {
    "name": "ウイルス性胃腸炎",
    "value": "ウイルス性胃腸炎",
    "synonyms": ["ウイルス性胃腸炎", "ウイルスセイイチョウエン", "ういるすせいいちょうえん"],
    "originSynonyms": ["ウイルス性胃腸炎"]
}, {
    "name": "過敏性大腸炎",
    "value": "過敏性大腸炎",
    "synonyms": ["過敏性大腸炎", "過敏性腸症候群", "カビンセイダイチョウエン", "カビンセイチョウショウコウグン", "かびんせいだいちょうえん", "かびんせいちょうしょうこうぐん"],
    "originSynonyms": ["過敏性大腸炎", "過敏性腸症候群"]
}, {
    "name": "かいよう性大腸炎",
    "value": "かいよう性大腸炎",
    "synonyms": ["かいよう性大腸炎", "潰瘍性大腸炎", "潰瘍性直腸炎", "カイヨウセイダイチョウエン", "カイヨウセイダイチョウエン", "カイヨウセイチョクチョウエン", "かいようせいだいちょうえん", "かいようせいだいちょうえん", "かいようせいちょくちょうえん", "かいよう性直腸炎"],
    "originSynonyms": ["かいよう性大腸炎", "潰瘍性大腸炎", "潰瘍性直腸炎"]
}, {
    "name": "クローン病",
    "value": "クローン病",
    "synonyms": ["クローン病", "限局性回腸炎", "クローンビョウ", "ゲンキョクセイカイチョウエン", "くろーんびょう", "げんきょくせいかいちょうえん"],
    "originSynonyms": ["クローン病", "限局性回腸炎"]
}, {
    "name": "腹膜炎",
    "value": "腹膜炎",
    "synonyms": ["腹膜炎", "フクマクエン", "ふくまくえん"],
    "originSynonyms": ["腹膜炎"]
}, {
    "name": "胃憩室症",
    "value": "胃憩室症",
    "synonyms": ["胃憩室症", "十二指腸憩室症", "胃憩室炎", "十二指腸憩室炎", "イケイシツショウ", "ジュウニシチョウケイシツショウ", "イケイシツエン", "ジュウニシチョウケイシツエン", "いけいしつしょう", "じゅうにしちょうけいしつしょう", "いけいしつえん", "じゅうにしちょうけいしつえん"],
    "originSynonyms": ["胃憩室症", "十二指腸憩室症", "胃憩室炎", "十二指腸憩室炎"]
}, {
    "name": "大腸憩室症",
    "value": "大腸憩室症",
    "synonyms": ["大腸憩室症", "小腸憩室症", "大腸憩室炎", "小腸憩室炎", "ダイチョウケイシツショウ", "ショウチョウケイシツショウ", "ダイチョウケイシツエン", "ショウチョウケイシツエン", "だいちょうけいしつしょう", "しょうちょうけいしつしょう", "だいちょうけいしつえん", "しょうちょうけいしつえん"],
    "originSynonyms": ["大腸憩室症", "小腸憩室症", "大腸憩室炎", "小腸憩室炎"]
}, {
    "name": "そけいヘルニア",
    "value": "そけいヘルニア",
    "synonyms": ["そけいヘルニア", "脱腸", "ソケイヘルニア", "ダッチョウ", "そけいへるにあ", "だっちょう"],
    "originSynonyms": ["そけいヘルニア", "脱腸"]
}, {
    "name": "臍ヘルニア",
    "value": "臍ヘルニア",
    "synonyms": ["臍ヘルニア", "サイヘルニア", "さいへるにあ"],
    "originSynonyms": ["臍ヘルニア"]
}, {
    "name": "便潜血",
    "value": "便潜血",
    "synonyms": ["便潜血", "ベンセンケツ", "べんせんけつ"],
    "originSynonyms": ["便潜血"]
}, {
    "name": "急性A型肝炎",
    "value": "急性A型肝炎",
    "synonyms": ["急性A型肝炎", "キュウセイAガタカンエン", "きゅうせいAがたかんえん", "キュウセイエーガタカンエン", "きゅうせいえーがたかんえん"],
    "originSynonyms": ["急性A型肝炎"]
}, {
    "name": "急性B型肝炎",
    "value": "急性B型肝炎",
    "synonyms": ["急性B型肝炎", "キュウセイBガタカンエン", "きゅうせいBがたかんえん", "キュウセイビーガタカンエン", "きゅうせいびーがたかんえん"],
    "originSynonyms": ["急性B型肝炎"]
}, {
    "name": "慢性B型肝炎",
    "value": "慢性B型肝炎",
    "synonyms": ["慢性B型肝炎", "マンセイBガタカンエン", "まんせいBがたかんえん", "マンセイビーガタカンエン", "まんせいびーがたかんえん"],
    "originSynonyms": ["慢性B型肝炎"]
}, {
    "name": "B型肝炎",
    "value": "B型肝炎",
    "synonyms": ["B型肝炎", "ウイルスキャリア", "HBV キャリア", "HBs抗原陽性", "Bガタカンエン", "HBsコウゲンヨウセイ", "Bがたかんえん", "ういるすきゃりあ", "HBV きゃりあ", "HBsこうげんようせい", "ビーガタカンエン", "びーがたかんえん", "エイチビーブイキャリア", "えいちびーぶいきゃりあ", "エイチビーエスコウゲンヨウセイ", "えいちびーえすこうげんようせい"],
    "originSynonyms": ["B型肝炎", "ウイルスキャリア", "HBV キャリア", "HBs抗原陽性"]
}, {
    "name": "Ｃ型肝炎",
    "value": "Ｃ型肝炎",
    "synonyms": ["Ｃ型肝炎", "Ｃ型慢性肝炎", "Ｃ型肝炎キャリア", "HCVキャリア", "Ｃガタカンエン", "Ｃガタマンセイカンエン", "Ｃガタカンエンキャリア", "Ｃがたかんえん", "Ｃがたまんせいかんえん", "Ｃがたかんえんきゃりあ", "HCVきゃりあ", "シーガタカンエン", "しーがたかんえん", "シーガタマンセイカンエン", "しーがたまんせいかんえん", "シーガタカンエンキャリア", "しーがたかんえんきゃりあ", "エイチシーブイキャリア", "えいちしーぶいきゃりあ"],
    "originSynonyms": ["Ｃ型肝炎", "Ｃ型慢性肝炎", "Ｃ型肝炎キャリア", "HCVキャリア"]
}, {
    "name": "アルコール性肝障害",
    "value": "アルコール性肝障害",
    "synonyms": ["アルコール性肝障害", "アルコールセイカンショウガイ", "あるこーるせいかんしょうがい"],
    "originSynonyms": ["アルコール性肝障害"]
}, {
    "name": "アルコール性肝炎",
    "value": "アルコール性肝炎",
    "synonyms": ["アルコール性肝炎", "アルコールセイカンエン", "あるこーるせいかんえん"],
    "originSynonyms": ["アルコール性肝炎"]
}, {
    "name": "自己免疫性肝炎",
    "value": "自己免疫性肝炎",
    "synonyms": ["自己免疫性肝炎", "ルポイド肝炎", "ジコメンエキセイカンエン", "ルポイドカンエン", "じこめんえきせいかんえん", "るぽいどかんえん"],
    "originSynonyms": ["自己免疫性肝炎", "ルポイド肝炎"]
}, {
    "name": "肝機能障害",
    "value": "肝機能障害",
    "synonyms": ["肝機能障害", "肝障害", "肝機能異常", "カンキノウショウガイ", "カンショウガイ", "カンキノウイジョウ", "かんきのうしょうがい", "かんしょうがい", "かんきのういじょう"],
    "originSynonyms": ["肝機能障害", "肝障害", "肝機能異常"]
}, {
    "name": "肝肥大",
    "value": "肝肥大",
    "synonyms": ["肝肥大", "肝腫脹", "肝腫大", "カンヒダイ", "カンシュチョウ", "カンシュダイ", "かんひだい", "かんしゅちょう", "かんしゅだい"],
    "originSynonyms": ["肝肥大", "肝腫脹", "肝腫大"]
}, {
    "name": "脂肪肝",
    "value": "脂肪肝",
    "synonyms": ["脂肪肝", "アルコール性脂肪肝", "過栄養性脂肪肝", "非アルコール性脂肪肝", "シボウカン", "アルコールセイシボウカン", "カエイヨウセイシボウカン", "ヒアルコールセイシボウカン", "しぼうかん", "あるこーるせいしぼうかん", "かえいようせいしぼうかん", "ひあるこーるせいしぼうかん"],
    "originSynonyms": ["脂肪肝", "アルコール性脂肪肝", "過栄養性脂肪肝", "非アルコール性脂肪肝"]
}, {
    "name": "肝硬変",
    "value": "肝硬変",
    "synonyms": ["肝硬変", "食道静脈瘤", "カンコウヘン", "ショクドウジョウミャクリュウ", "かんこうへん", "しょくどうじょうみゃくりゅう"],
    "originSynonyms": ["肝硬変", "食道静脈瘤"]
}, {
    "name": "急性すい炎",
    "value": "急性すい炎",
    "synonyms": ["急性すい炎", "キュウセイスイエン", "きゅうせいすいえん", "急性膵炎"],
    "originSynonyms": ["急性すい炎"]
}, {
    "name": "慢性すい炎",
    "value": "慢性すい炎",
    "synonyms": ["慢性すい炎", "マンセイスイエン", "まんせいすいえん", "慢性膵炎"],
    "originSynonyms": ["慢性すい炎"]
}, {
    "name": "膵のう胞",
    "value": "膵のう胞",
    "synonyms": ["膵のう胞", "スイノウホウ", "すいのうほう", "膵嚢胞"],
    "originSynonyms": ["膵のう胞"]
}, {
    "name": "胆石",
    "value": "胆石",
    "synonyms": ["胆石", "胆嚢結石", "タンセキ", "タンノウケッセキ", "たんせき", "たんのうけっせき", "胆のう結石"],
    "originSynonyms": ["胆石", "胆嚢結石"]
}, {
    "name": "総胆管結石",
    "value": "総胆管結石",
    "synonyms": ["総胆管結石", "胆管結石", "ソウタンカンケッセキ", "タンカンケッセキ", "そうたんかんけっせき", "たんかんけっせき"],
    "originSynonyms": ["総胆管結石", "胆管結石"]
}, {
    "name": "胆のう炎",
    "value": "胆のう炎",
    "synonyms": ["胆のう炎", "タンノウエン", "たんのうえん", "胆嚢炎"],
    "originSynonyms": ["胆のう炎"]
}, {
    "name": "痔裂",
    "value": "痔裂",
    "synonyms": ["痔裂", "裂肛", "切れ痔", "ジレツ", "レッコウ", "キレジ", "じれつ", "れっこう", "きれじ"],
    "originSynonyms": ["痔裂", "裂肛", "切れ痔"]
}, {
    "name": "痔核",
    "value": "痔核",
    "synonyms": ["痔核", "脱肛", "ジカク", "ダッコウ", "じかく", "だっこう"],
    "originSynonyms": ["痔核", "脱肛"]
}, {
    "name": "痔ろう",
    "value": "痔ろう",
    "synonyms": ["痔ろう", "肛門周囲膿瘍", "ジロウ", "コウモンシュウイノウヨウ", "じろう", "こうもんしゅういのうよう"],
    "originSynonyms": ["痔ろう", "肛門周囲膿瘍"]
}]
var j = [{
    "name": "尿たんぱく",
    "value": "尿たんぱく",
    "synonyms": ["尿たんぱく", "ニョウタンパク", "にょうたんぱく", "尿蛋白"],
    "originSynonyms": ["尿たんぱく"]
}, {
    "name": "尿潜血",
    "value": "尿潜血",
    "synonyms": ["尿潜血", "血尿", "ニョウセンケツ", "ケツニョウ", "にょうせんけつ", "けつにょう"],
    "originSynonyms": ["尿潜血", "血尿"]
}, {
    "name": "急性腎炎",
    "value": "急性腎炎",
    "synonyms": ["急性腎炎", "急性糸球体腎炎", "キュウセイジンエン", "キュウセイシキュウタイジンエン", "きゅうせいじんえん", "きゅうせいしきゅうたいじんえん"],
    "originSynonyms": ["急性腎炎", "急性糸球体腎炎"]
}, {
    "name": "腎盂炎",
    "value": "腎盂炎",
    "synonyms": ["腎盂炎", "腎盂腎炎", "ジンウエン", "ジンウジンエン", "じんうえん", "じんうじんえん"],
    "originSynonyms": ["腎盂炎", "腎盂腎炎"]
}, {
    "name": "慢性腎炎",
    "value": "慢性腎炎",
    "synonyms": ["慢性腎炎", "ネフローゼ症候群", "IgA腎症", "慢性糸球体腎炎", "マンセイジンエン", "ネフローゼショウコウグン", "IgAジンショウ", "マンセイシキュウタイジンエン", "まんせいじんえん", "ねふろーぜしょうこうぐん", "IgAじんしょう", "まんせいしきゅうたいじんえん", "アイジーエージンショウ", "あいじーえーじんしょう"],
    "originSynonyms": ["慢性腎炎", "ネフローゼ症候群", "IgA腎症", "慢性糸球体腎炎"]
}, {
    "name": "人工透析",
    "value": "人工透析",
    "synonyms": ["人工透析", "ジンコウトウセキ", "じんこうとうせき"],
    "originSynonyms": ["人工透析"]
}, {
    "name": "のう胞腎",
    "value": "のう胞腎",
    "synonyms": ["のう胞腎", "ノウホウジン", "のうほうじん", "嚢胞腎"],
    "originSynonyms": ["のう胞腎"]
}, {
    "name": "急性腎不全",
    "value": "急性腎不全",
    "synonyms": ["急性腎不全", "キュウセイジンフゼン", "きゅうせいじんふぜん"],
    "originSynonyms": ["急性腎不全"]
}, {
    "name": "慢性腎不全",
    "value": "慢性腎不全",
    "synonyms": ["慢性腎不全", "腎不全", "マンセイジンフゼン", "ジンフゼン", "まんせいじんふぜん", "じんふぜん"],
    "originSynonyms": ["慢性腎不全", "腎不全"]
}, {
    "name": "腎臓結石",
    "value": "腎臓結石",
    "synonyms": ["腎臓結石", "尿管結石", "ジンゾウケッセキ", "ニョウカンケッセキ", "じんぞうけっせき", "にょうかんけっせき"],
    "originSynonyms": ["腎臓結石", "尿管結石"]
}, {
    "name": "前立腺炎",
    "value": "前立腺炎",
    "synonyms": ["前立腺炎", "ゼンリツセンエン", "ぜんりつせんえん"],
    "originSynonyms": ["前立腺炎"]
}, {
    "name": "前立腺肥大",
    "value": "前立腺肥大",
    "synonyms": ["前立腺肥大", "ゼンリツセンヒダイ", "ぜんりつせんひだい"],
    "originSynonyms": ["前立腺肥大"]
}, {
    "name": "尿道結石",
    "value": "尿道結石",
    "synonyms": ["尿道結石", "膀胱結石", "ニョウドウケッセキ", "ボウコウケッセキ", "にょうどうけっせき", "ぼうこうけっせき"],
    "originSynonyms": ["尿道結石", "膀胱結石"]
}, {
    "name": "膀胱炎",
    "value": "膀胱炎",
    "synonyms": ["膀胱炎", "尿道炎", "ボウコウエン", "ニョウドウエン", "ぼうこうえん", "にょうどうえん"],
    "originSynonyms": ["膀胱炎", "尿道炎"]
}, {
    "name": "陰嚢水腫",
    "value": "陰嚢水腫",
    "synonyms": ["陰嚢水腫", "精索静脈瘤", "インノウスイシュ", "セイサクジョウミャクリュウ", "いんのうすいしゅ", "せいさくじょうみゃくりゅう", "陰のう水腫"],
    "originSynonyms": ["陰嚢水腫", "精索静脈瘤"]
}, {
    "name": "停留睾丸",
    "value": "停留睾丸",
    "synonyms": ["停留睾丸", "停留精巣", "テイリュウコウガン", "テイリュウセイソウ", "ていりゅうこうがん", "ていりゅうせいそう"],
    "originSynonyms": ["停留睾丸", "停留精巣"]
}, {
    "name": "乳腺炎",
    "value": "乳腺炎",
    "synonyms": ["乳腺炎", "乳腺膿瘍", "ニュウセンエン", "ニュウセンノウヨウ", "にゅうせんえん", "にゅうせんのうよう"],
    "originSynonyms": ["乳腺炎", "乳腺膿瘍"]
}, {
    "name": "乳腺症",
    "value": "乳腺症",
    "synonyms": ["乳腺症", "ニュウセンショウ", "にゅうせんしょう"],
    "originSynonyms": ["乳腺症"]
}, {
    "name": "月経異常",
    "value": "月経異常",
    "synonyms": ["月経異常", "生理不順", "生理痛", "月経困難症", "月経前症候群", "ゲッケイイジョウ", "セイリフジュン", "セイリツウ", "ゲッケイコンナンショウ", "ゲッケイマエショウコウグン", "げっけいいじょう", "せいりふじゅん", "せいりつう", "げっけいこんなんしょう", "げっけいまえしょうこうぐん"],
    "originSynonyms": ["月経異常", "生理不順", "生理痛", "月経困難症", "月経前症候群"]
}, {
    "name": "子宮頚部異形成",
    "value": "子宮頚部異形成",
    "synonyms": ["子宮頚部異形成", "子宮頚部異型上皮", "シキュウケイブイケイセイ", "シキュウケイブイケイジョウヒ", "しきゅうけいぶいけいせい", "しきゅうけいぶいけいじょうひ", "子宮頸部異形成", "子宮頸部異形上皮"],
    "originSynonyms": ["子宮頚部異形成", "子宮頚部異型上皮"]
}, {
    "name": "子宮内膜炎",
    "value": "子宮内膜炎",
    "synonyms": ["子宮内膜炎", "シキュウナイマクエン", "しきゅうないまくえん"],
    "originSynonyms": ["子宮内膜炎"]
}, {
    "name": "子宮内膜症",
    "value": "子宮内膜症",
    "synonyms": ["子宮内膜症", "チョコレートのう胞", "チョコレートのう腫", "シキュウナイマクショウ", "チョコレートノウホウ", "チョコレートノウシュ", "しきゅうないまくしょう", "ちょこれーとのうほう", "ちょこれーとのうしゅ", "チョコレート嚢胞", "チョコレート嚢腫"],
    "originSynonyms": ["子宮内膜症", "チョコレートのう胞", "チョコレートのう腫"]
}, {
    "name": "子宮腺筋症",
    "value": "子宮腺筋症",
    "synonyms": ["子宮腺筋症", "シキュウセンキンショウ", "しきゅうせんきんしょう"],
    "originSynonyms": ["子宮腺筋症"]
}, {
    "name": "子宮脱",
    "value": "子宮脱",
    "synonyms": ["子宮脱", "シキュウダツ", "しきゅうだつ"],
    "originSynonyms": ["子宮脱"]
}, {
    "name": "卵管炎",
    "value": "卵管炎",
    "synonyms": ["卵管炎", "卵巣炎", "子宮付属器炎", "付属器炎（子宮）", "ランカンエン", "ランソウエン", "シキュウフゾクキエン", "フゾクキエン（シキュウ）", "らんかんえん", "らんそうえん", "しきゅうふぞくきえん", "ふぞくきえん（しきゅう）"],
    "originSynonyms": ["卵管炎", "卵巣炎", "子宮付属器炎", "付属器炎（子宮）"]
}, {
    "name": "骨盤腹膜炎",
    "value": "骨盤腹膜炎",
    "synonyms": ["骨盤腹膜炎", "コツバンフクマクエン", "こつばんふくまくえん"],
    "originSynonyms": ["骨盤腹膜炎"]
}, {
    "name": "更年期障害",
    "value": "更年期障害",
    "synonyms": ["更年期障害", "コウネンキショウガイ", "こうねんきしょうがい"],
    "originSynonyms": ["更年期障害"]
}]
var k = [{
    "name": "妊娠",
    "value": "妊娠",
    "synonyms": ["妊娠", "正常妊娠", "正常分娩", "吸引分娩", "鉗子分娩", "ニンシン", "セイジョウニンシン", "セイジョウブンベン", "キュウインブンベン", "カンシブンベン", "にんしん", "せいじょうにんしん", "せいじょうぶんべん", "きゅういんぶんべん", "かんしぶんべん"],
    "originSynonyms": ["妊娠", "正常妊娠", "正常分娩", "吸引分娩", "鉗子分娩"]
}, {
    "name": "子宮外妊娠",
    "value": "子宮外妊娠",
    "synonyms": ["子宮外妊娠", "シキュウガイニンシン", "しきゅうがいにんしん"],
    "originSynonyms": ["子宮外妊娠"]
}, {
    "name": "妊娠中毒症",
    "value": "妊娠中毒症",
    "synonyms": ["妊娠中毒症", "妊娠高血圧症候群", "悪阻", "つわり", "妊娠悪阻", "ニンシンチュウドクショウ", "ニンシンコウケツアツショウコウグン", "オソ", "ツワリ", "ニンシンオソ", "にんしんちゅうどくしょう", "にんしんこうけつあつしょうこうぐん", "おそ", "にんしんおそ"],
    "originSynonyms": ["妊娠中毒症", "妊娠高血圧症候群", "悪阻", "つわり", "妊娠悪阻"]
}, {
    "name": "切迫早産",
    "value": "切迫早産",
    "synonyms": ["切迫早産", "早産", "切迫流産", "流産", "死産", "セッパクソウザン", "ソウザン", "セッパクリュウザン", "リュウザン", "シザン", "せっぱくそうざん", "そうざん", "せっぱくりゅうざん", "りゅうざん", "しざん"],
    "originSynonyms": ["切迫早産", "早産", "切迫流産", "流産", "死産"]
}, {
    "name": "胎盤剥離",
    "value": "胎盤剥離",
    "synonyms": ["胎盤剥離", "前置胎盤", "タイバンハクリ", "ゼンチタイバン", "たいばんはくり", "ぜんちたいばん"],
    "originSynonyms": ["胎盤剥離", "前置胎盤"]
}, {
    "name": "帝王切開",
    "value": "帝王切開",
    "synonyms": ["帝王切開", "テイオウセッカイ", "ていおうせっかい"],
    "originSynonyms": ["帝王切開"]
}, {
    "name": "不妊症",
    "value": "不妊症",
    "synonyms": ["不妊症", "フニンショウ", "ふにんしょう"],
    "originSynonyms": ["不妊症"]
}, {
    "name": "人工流産",
    "value": "人工流産",
    "synonyms": ["人工流産", "ジンコウリュウザン", "じんこうりゅうざん"],
    "originSynonyms": ["人工流産"]
}]
var l = [{
    "name": "四十肩",
    "value": "四十肩",
    "synonyms": ["四十肩", "五十肩", "肩関節周囲炎", "シジュウカタ", "ゴジュウカタ", "カタカンセツシュウイエン", "しじゅうかた", "ごじゅうかた", "かたかんせつしゅういえん"],
    "originSynonyms": ["四十肩", "五十肩", "肩関節周囲炎"]
}, {
    "name": "大腿骨骨頭壊死",
    "value": "大腿骨骨頭壊死",
    "synonyms": ["大腿骨骨頭壊死", "ダイタイコツコットウエシ", "だいたいこつこっとうえし"],
    "originSynonyms": ["大腿骨骨頭壊死"]
}, {
    "name": "ガングリオン",
    "value": "ガングリオン",
    "synonyms": ["ガングリオン", "がんぐりおん"],
    "originSynonyms": ["ガングリオン"]
}, {
    "name": "腱鞘炎",
    "value": "腱鞘炎",
    "synonyms": ["腱鞘炎", "ケンショウエン", "けんしょうえん"],
    "originSynonyms": ["腱鞘炎"]
}, {
    "name": "手根管症候群",
    "value": "手根管症候群",
    "synonyms": ["手根管症候群", "シュコンカンショウコウグン", "しゅこんかんしょうこうぐん"],
    "originSynonyms": ["手根管症候群"]
}, {
    "name": "先天性股関節脱臼",
    "value": "先天性股関節脱臼",
    "synonyms": ["先天性股関節脱臼", "センテンセイコカンセツダッキュウ", "せんてんせいこかんせつだっきゅう"],
    "originSynonyms": ["先天性股関節脱臼"]
}, {
    "name": "骨粗しょう症",
    "value": "骨粗しょう症",
    "synonyms": ["骨粗しょう症", "コツソショウショウ", "こつそしょうしょう"],
    "originSynonyms": ["骨粗しょう症"]
}, {
    "name": "変形性脊椎症",
    "value": "変形性脊椎症",
    "synonyms": ["変形性脊椎症", "変形性頚椎症", "変形性胸椎症", "変形性腰椎症", "ヘンケイセイセキツイショウ", "ヘンケイセイケイツイショウ", "ヘンケイセイキョウツイショウ", "ヘンケイセイヨウツイショウ", "へんけいせいせきついしょう", "へんけいせいけいついしょう", "へんけいせいきょうついしょう", "へんけいせいようついしょう"],
    "originSynonyms": ["変形性脊椎症", "変形性頚椎症", "変形性胸椎症", "変形性腰椎症"]
}, {
    "name": "変形性股関節症",
    "value": "変形性股関節症",
    "synonyms": ["変形性股関節症", "変形性膝関節症", "変形性足関節症", "ヘンケイセイコカンセツショウ", "ヘンケイセイヒザカンセツショウ", "ヘンケイセイアシカンセツショウ", "へんけいせいこかんせつしょう", "へんけいせいひざかんせつしょう", "へんけいせいあしかんせつしょう"],
    "originSynonyms": ["変形性股関節症", "変形性膝関節症", "変形性足関節症"]
}, {
    "name": "人工関節",
    "value": "人工関節",
    "synonyms": ["人工関節", "ジンコウカンセツ", "じんこうかんせつ"],
    "originSynonyms": ["人工関節"]
}, {
    "name": "脊柱管狭窄症",
    "value": "脊柱管狭窄症",
    "synonyms": ["脊柱管狭窄症", "セキチュウカンキョウサクショウ", "せきちゅうかんきょうさくしょう"],
    "originSynonyms": ["脊柱管狭窄症"]
}, {
    "name": "後縦靭帯骨化症",
    "value": "後縦靭帯骨化症",
    "synonyms": ["後縦靭帯骨化症", "コウジュウジンタイコッカショウ", "こうじゅうじんたいこっかしょう"],
    "originSynonyms": ["後縦靭帯骨化症"]
}, {
    "name": "関節リウマチ",
    "value": "関節リウマチ",
    "synonyms": ["関節リウマチ", "慢性関節リウマチ", "リウマチ様関節炎", "カンセツリウマチ", "マンセイカンセツリウマチ", "リウマチヨウカンセツエン", "かんせつりうまち", "まんせいかんせつりうまち", "りうまちようかんせつえん"],
    "originSynonyms": ["関節リウマチ", "慢性関節リウマチ", "リウマチ様関節炎"]
}, {
    "name": "頚肩腕症候群",
    "value": "頚肩腕症候群",
    "synonyms": ["頚肩腕症候群", "ケイケンワンショウコウグン", "けいけんわんしょうこうぐん"],
    "originSynonyms": ["頚肩腕症候群"]
}]
var m = [{
    "name": "やけど",
    "value": "やけど",
    "synonyms": ["やけど", "火傷", "凍傷", "ヤケド", "トウショウ", "とうしょう"],
    "originSynonyms": ["やけど", "火傷", "凍傷"]
}, {
    "name": "むちうち症",
    "value": "むちうち症",
    "synonyms": ["むちうち症", "捻挫（頚椎・頚部）", "頚椎捻挫", "ムチウチショウ", "ネンザ（ケイツイ・ケイブ）", "ケイツイネンザ", "むちうちしょう", "ねんざ（けいつい・けいぶ）", "けいついねんざ"],
    "originSynonyms": ["むちうち症", "捻挫（頚椎・頚部）", "頚椎捻挫"]
}, {
    "name": "捻挫（腰部・腰椎）",
    "value": "捻挫（腰部・腰椎）",
    "synonyms": ["捻挫（腰部・腰椎）", "ネンザ（ヨウブ・ヨウツイ）", "ねんざ（ようぶ・ようつい）"],
    "originSynonyms": ["捻挫（腰部・腰椎）"]
}, {
    "name": "捻挫（上肢・下肢）",
    "value": "捻挫（上肢・下肢）",
    "synonyms": ["捻挫（上肢・下肢）", "ネンザ（ジョウシ・カシ）", "ねんざ（じょうし・かし）"],
    "originSynonyms": ["捻挫（上肢・下肢）"]
}, {
    "name": "打撲（顔面）",
    "value": "打撲（顔面）",
    "synonyms": ["打撲（顔面）", "ダボク（ガンメン）", "だぼく（がんめん）"],
    "originSynonyms": ["打撲（顔面）"]
}, {
    "name": "打撲（頭部）",
    "value": "打撲（頭部）",
    "synonyms": ["打撲（頭部）", "脳震盪", "ダボク（トウブ）", "ノウシントウ", "だぼく（とうぶ）", "のうしんとう", "脳しんとう"],
    "originSynonyms": ["打撲（頭部）", "脳震盪"]
}, {
    "name": "打撲（上肢・下肢）",
    "value": "打撲（上肢・下肢）",
    "synonyms": ["打撲（上肢・下肢）", "ダボク（ジョウシ・カシ）", "だぼく（じょうし・かし）"],
    "originSynonyms": ["打撲（上肢・下肢）"]
}, {
    "name": "打撲（胸部・腹部）",
    "value": "打撲（胸部・腹部）",
    "synonyms": ["打撲（胸部・腹部）", "ダボク（キョウブ・フクブ）", "だぼく（きょうぶ・ふくぶ）"],
    "originSynonyms": ["打撲（胸部・腹部）"]
}, {
    "name": "打撲（頚椎・頚部）",
    "value": "打撲（頚椎・頚部）",
    "synonyms": ["打撲（頚椎・頚部）", "ダボク（ケイツイ・ケイブ）", "だぼく（けいつい・けいぶ）"],
    "originSynonyms": ["打撲（頚椎・頚部）"]
}, {
    "name": "打撲（腰部）",
    "value": "打撲（腰部）",
    "synonyms": ["打撲（腰部）", "ダボク（ヨウブ）", "だぼく（ようぶ）"],
    "originSynonyms": ["打撲（腰部）"]
}, {
    "name": "骨折（顔面）",
    "value": "骨折（顔面）",
    "synonyms": ["骨折（顔面）", "コッセツ（ガンメン）", "こっせつ（がんめん）"],
    "originSynonyms": ["骨折（顔面）"]
}, {
    "name": "骨折（頭蓋骨）",
    "value": "骨折（頭蓋骨）",
    "synonyms": ["骨折（頭蓋骨）", "コッセツ（ズガイコツ）", "こっせつ（ずがいこつ）"],
    "originSynonyms": ["骨折（頭蓋骨）"]
}, {
    "name": "骨折（脊椎・脊柱・背骨）",
    "value": "骨折（脊椎・脊柱・背骨）",
    "synonyms": ["骨折（脊椎・脊柱・背骨）", "腰椎骨折", "胸椎骨折", "コッセツ（セキツイ・セキチュウ・セボネ）", "ヨウツイコッセツ", "キョウツイコッセツ", "こっせつ（せきつい・せきちゅう・せぼね）", "ようついこっせつ", "きょうついこっせつ"],
    "originSynonyms": ["骨折（脊椎・脊柱・背骨）", "腰椎骨折", "胸椎骨折"]
}, {
    "name": "骨折（骨盤・鎖骨・上肢・下肢・肋骨・顎骨）",
    "value": "骨折（骨盤・鎖骨・上肢・下肢・肋骨・顎骨）",
    "synonyms": ["骨折（骨盤・鎖骨・上肢・下肢・肋骨・顎骨）", "コッセツ（コツバン・サコツ・ジョウシ・カシ・ロッコツ・ガッコツ）", "こっせつ（こつばん・さこつ・じょうし・かし・ろっこつ・がっこつ）"],
    "originSynonyms": ["骨折（骨盤・鎖骨・上肢・下肢・肋骨・顎骨）"]
}, {
    "name": "外傷性くも膜下出血",
    "value": "外傷性くも膜下出血",
    "synonyms": ["外傷性くも膜下出血", "硬膜下出血", "脳挫傷", "ガイショウセイクモマクカシュッケツ", "コウマクカシュッケツ", "ノウザショウ", "がいしょうせいくもまくかしゅっけつ", "こうまくかしゅっけつ", "のうざしょう"],
    "originSynonyms": ["外傷性くも膜下出血", "硬膜下出血", "脳挫傷"]
}, {
    "name": "脱臼（肩）",
    "value": "脱臼（肩）",
    "synonyms": ["脱臼（肩）", "ダッキュウ（カタ）", "だっきゅう（かた）"],
    "originSynonyms": ["脱臼（肩）"]
}, {
    "name": "脱臼（上肢・下肢）",
    "value": "脱臼（上肢・下肢）",
    "synonyms": ["脱臼（上肢・下肢）", "ダッキュウ（ジョウシ・カシ）", "だっきゅう（じょうし・かし）"],
    "originSynonyms": ["脱臼（上肢・下肢）"]
}, {
    "name": "靭帯損傷（膝・足）",
    "value": "靭帯損傷（膝・足）",
    "synonyms": ["靭帯損傷（膝・足）", "ジンタイソンショウ（ヒザ・アシ）", "じんたいそんしょう（ひざ・あし）"],
    "originSynonyms": ["靭帯損傷（膝・足）"]
}, {
    "name": "靭帯損傷（膝・足以外）",
    "value": "靭帯損傷（膝・足以外）",
    "synonyms": ["靭帯損傷（膝・足以外）", "ジンタイソンショウ", "（ヒザ・アシイガイ）", "じんたいそんしょう", "（ひざ・あしいがい）"],
    "originSynonyms": ["靭帯損傷（膝・足以外）"]
}, {
    "name": "脊椎損傷",
    "value": "脊椎損傷",
    "synonyms": ["脊椎損傷", "頚椎損傷", "セキツイソンショウ", "ケイツイソンショウ", "せきついそんしょう", "けいついそんしょう"],
    "originSynonyms": ["脊椎損傷", "頚椎損傷"]
}, {
    "name": "半月板損傷",
    "value": "半月板損傷",
    "synonyms": ["半月板損傷", "ハンゲツバンソンショウ", "はんげつばんそんしょう"],
    "originSynonyms": ["半月板損傷"]
}, {
    "name": "アキレス腱断裂",
    "value": "アキレス腱断裂",
    "synonyms": ["アキレス腱断裂", "腱板断裂", "アキレスケンダンレツ", "ケンバンダンレツ", "あきれすけんだんれつ", "けんばんだんれつ"],
    "originSynonyms": ["アキレス腱断裂", "腱板断裂"]
}]
var n = [{
    "name": "にきび",
    "value": "にきび",
    "synonyms": ["にきび", "ニキビ"],
    "originSynonyms": ["にきび"]
}, {
    "name": "ほくろ",
    "value": "ほくろ",
    "synonyms": ["ほくろ", "ホクロ"],
    "originSynonyms": ["ほくろ"]
}, {
    "name": "いぼ",
    "value": "いぼ",
    "synonyms": ["いぼ", "イボ"],
    "originSynonyms": ["いぼ"]
}, {
    "name": "粉瘤",
    "value": "粉瘤",
    "synonyms": ["粉瘤", "アテローム", "フンリュウ", "ふんりゅう", "あてろーむ"],
    "originSynonyms": ["粉瘤", "アテローム"]
}, {
    "name": "しもやけ",
    "value": "しもやけ",
    "synonyms": ["しもやけ", "凍瘡", "シモヤケ", "トウソウ", "とうそう"],
    "originSynonyms": ["しもやけ", "凍瘡"]
}, {
    "name": "円形脱毛症",
    "value": "円形脱毛症",
    "synonyms": ["円形脱毛症", "エンケイダツモウショウ", "えんけいだつもうしょう"],
    "originSynonyms": ["円形脱毛症"]
}, {
    "name": "たむし",
    "value": "たむし",
    "synonyms": ["たむし", "班状小水疱性白癬", "タムシ", "ハンジョウショウスイホウセイハクセン", "はんじょうしょうすいほうせいはくせん"],
    "originSynonyms": ["たむし", "班状小水疱性白癬"]
}, {
    "name": "みずむし",
    "value": "みずむし",
    "synonyms": ["みずむし", "ミズムシ"],
    "originSynonyms": ["みずむし"]
}, {
    "name": "爪白癬",
    "value": "爪白癬",
    "synonyms": ["爪白癬", "ツメハクセン", "つめはくせん"],
    "originSynonyms": ["爪白癬"]
}, {
    "name": "みずぼうそう",
    "value": "みずぼうそう",
    "synonyms": ["みずぼうそう", "ミズボウソウ", "水ぼうそう", "水疱瘡"],
    "originSynonyms": ["みずぼうそう"]
}, {
    "name": "癰",
    "value": "癰",
    "synonyms": ["癰", "ストロフルス", "皮膚の膿瘍", "毛巣洞", "毛巣嚢腫", "伝染性膿痂疹", "とびひ", "蜂窩織炎", "丹毒", "ひょう疽", "ヘルペス", "帯状疱疹", "ヨウ", "ヒフノノウヨウ", "モウソウドウ", "モウソウノウシュ", "デンセンセイノウカシン", "トビヒ", "ホウカシキエン", "タンドク", "ヒョウソ", "タイジョウホウシン", "よう", "すとろふるす", "ひふののうよう", "もうそうどう", "もうそうのうしゅ", "でんせんせいのうかしん", "ほうかしきえん", "たんどく", "ひょうそ", "へるぺす", "たいじょうほうしん"],
    "originSynonyms": ["癰", "ストロフルス", "皮膚の膿瘍", "毛巣洞", "毛巣嚢腫", "伝染性膿痂疹", "とびひ", "蜂窩織炎", "丹毒", "ひょう疽", "ヘルペス", "帯状疱疹"]
}, {
    "name": "じんましん",
    "value": "じんましん",
    "synonyms": ["じんましん", "蕁麻疹", "ジンマシン"],
    "originSynonyms": ["じんましん", "蕁麻疹"]
}, {
    "name": "アトピー性皮膚炎",
    "value": "アトピー性皮膚炎",
    "synonyms": ["アトピー性皮膚炎", "アトピーセイヒフエン", "あとぴーせいひふえん"],
    "originSynonyms": ["アトピー性皮膚炎"]
}, {
    "name": "湿疹",
    "value": "湿疹",
    "synonyms": ["湿疹", "接触性皮膚炎", "シッシン", "セッショクセイヒフエン", "しっしん", "せっしょくせいひふえん"],
    "originSynonyms": ["湿疹", "接触性皮膚炎"]
}, {
    "name": "あざ",
    "value": "あざ",
    "synonyms": ["あざ", "母斑", "皮膚の血管腫", "アザ", "ボハン", "ヒフノケッカンシュ", "ぼはん", "ひふのけっかんしゅ", "痣"],
    "originSynonyms": ["あざ", "母斑", "皮膚の血管腫"]
}, {
    "name": "乾癬",
    "value": "乾癬",
    "synonyms": ["乾癬", "カンセン", "かんせん"],
    "originSynonyms": ["乾癬"]
}, {
    "name": "尋常性天疱瘡",
    "value": "尋常性天疱瘡",
    "synonyms": ["尋常性天疱瘡", "類天疱瘡", "ジンジョウセイテンポウソウ", "ルイテンポウソウ", "じんじょうせいてんぽうそう", "るいてんぽうそう"],
    "originSynonyms": ["尋常性天疱瘡", "類天疱瘡"]
}, {
    "name": "掌蹠膿疱症",
    "value": "掌蹠膿疱症",
    "synonyms": ["掌蹠膿疱症", "ショウセキノウホウショウ", "しょうせきのうほうしょう"],
    "originSynonyms": ["掌蹠膿疱症"]
}]
var o = [{
    "name": "アルコール依存症",
    "value": "アルコール依存症",
    "synonyms": ["アルコール依存症", "アルコールイゾンショウ", "あるこーるいぞんしょう"],
    "originSynonyms": ["アルコール依存症"]
}, {
    "name": "薬物依存症",
    "value": "薬物依存症",
    "synonyms": ["薬物依存症", "麻薬中毒", "覚醒剤中毒", "ヤクブツイゾンショウ", "マヤクチュウドク", "カクセイザイチュウドク", "やくぶついぞんしょう", "まやくちゅうどく", "かくせいざいちゅうどく"],
    "originSynonyms": ["薬物依存症", "麻薬中毒", "覚醒剤中毒"]
}, {
    "name": "ベーチェット病",
    "value": "ベーチェット病",
    "synonyms": ["ベーチェット病", "ベーチェット症候群", "ベーチェットビョウ", "ベーチェットショウコウグン", "べーちぇっとびょう", "べーちぇっとしょうこうぐん"],
    "originSynonyms": ["ベーチェット病", "ベーチェット症候群"]
}, {
    "name": "シェーグレン症候群",
    "value": "シェーグレン症候群",
    "synonyms": ["シェーグレン症候群", "シェーグレンショウコウグン", "しぇーぐれんしょうこうぐん"],
    "originSynonyms": ["シェーグレン症候群"]
}, {
    "name": "サルコイドーシス",
    "value": "サルコイドーシス",
    "synonyms": ["サルコイドーシス", "さるこいどーしす"],
    "originSynonyms": ["サルコイドーシス"]
}, {
    "name": "全身性エリテマトーデス",
    "value": "全身性エリテマトーデス",
    "synonyms": ["全身性エリテマトーデス", "全身性紅斑性狼瘡", "ゼンシンセイエリテマトーデス", "ゼンシンセイコウハンセイロウソウ", "ぜんしんせいえりてまとーです", "ぜんしんせいこうはんせいろうそう"],
    "originSynonyms": ["全身性エリテマトーデス", "全身性紅斑性狼瘡"]
}, {
    "name": "皮膚筋炎",
    "value": "皮膚筋炎",
    "synonyms": ["皮膚筋炎", "多発性筋炎", "ヒフキンエン", "タハツセイキンエン", "ひふきんえん", "たはつせいきんえん"],
    "originSynonyms": ["皮膚筋炎", "多発性筋炎"]
}, {
    "name": "全身性強皮症",
    "value": "全身性強皮症",
    "synonyms": ["全身性強皮症", "ゼンシンセイキョウヒショウ", "ぜんしんせいきょうひしょう"],
    "originSynonyms": ["全身性強皮症"]
}, {
    "name": "膠原病",
    "value": "膠原病",
    "synonyms": ["膠原病", "コウゲンビョウ", "こうげんびょう", "こうげん病"],
    "originSynonyms": ["膠原病"]
}]


const datas = a.concat(b, c, d, e, f, g, h,i, j, k, l, m, n, o)

const mergedata = datas.map((data) => {
    return data.synonyms
})

window.dataComplete= mergedata.flat()